In [11]:
import numpy as np
import pandas as pd
#from pandas import DataFrame as DF

In [14]:
df=DF(
    [
        ['Akash','Torvi','Full-Time','administraction',2,20000],
        ['Harshad','Walikar','Full-Time','Technical',4,30000],
        ['Rahul','B','intrn','administraction',2,40000],
        ['Abhinav','nai','Full-Time','administraction',6,50000],
        ['Gurya','Biradar','Part-Time','managemant',2,20000],
    ],columns=['Frist name','Last name','Type','Department','YOE','Salary']



    )
df

  Frist name Last name       Type       Department  YOE  Salary
0      Akash     Torvi  Full-Time  administraction    2   20000
1    Harshad   Walikar  Full-Time        Technical    4   30000
2      Rahul         B      intrn  administraction    2   40000
3    Abhinav       nai  Full-Time  administraction    6   50000
4      Gurya   Biradar  Part-Time       managemant    2   20000

1. Make a pivot table which shows average salary of each type of employee for each 
department.

In [15]:
table = pd.pivot_table(df,index ='Type',columns='Department',values='Salary',aggfunc='sum')
table

Department  Technical  administraction  managemant
Type
Full-Time     30000.0          70000.0         NaN
Part-Time         NaN              NaN     20000.0
intrn             NaN          40000.0         NaN

2. Make a pivot table which shows the sum and mean of the salaries of each type of 
employee and the number of employees of each type.

In [16]:
table = pd.pivot_table(df,index ='Type',values='Salary',aggfunc=['sum','mean','count'])
table

              sum          mean  count
           Salary        Salary Salary
Type
Full-Time  100000  33333.333333      3
Part-Time   20000  20000.000000      1
intrn       40000  40000.000000      1

3. desplay povit table to count sarvival by gender ,catagoris vs age of varias     
categorie1 0-10
categorie2 10---30
categorie3 30-60
categorie4 60-80

In [12]:

df = pd.read_csv('dataset/titanic.csv')
age = pd.cut(df['Age'], [0, 10, 30, 60, 80])
result = df.pivot_table('Survived', index=['Sex',age], columns='Pclass', aggfunc='count')
print(result)

Pclass            1   2    3
Sex    Age
female (0, 10]    1   8   22
       (10, 30]  34  36   56
       (30, 60]  46  30   22
       (60, 80]   2   0    1
male   (0, 10]    2   9   22
       (10, 30]  24  43  151
       (30, 60]  63  44   76
       (60, 80]  12   3    4